package com.nodam.server.service;

import java.util.HashMap;

public class MajorCollegeMap extends HashMap<String, String> {

    public MajorCollegeMap() {
        super();
        this.put("건설환경공학과" , "공과대학");
        this.put("건축공학과" , "공과대학");
        this.put("건축공학부 건축공학전공" , "공과대학");
        this.put("건축공학부 건축학전공" , "공과대학");
        this.put("건축공학전공" , "공과대학");
        this.put("건축학전공" , "공과대학");
        this.put("건축학과" , "공과대학");
        this.put("국방시스템공학과" , "공과대학");
        this.put("기계공학과" , "공과대학");
        this.put("기계항공우주공학부 기계공학전공" , "공과대학");
        this.put("기계항공우주공학부 항공우주공학전공" , "공과대학");
        this.put("기계공학전공" , "공과대학");
        this.put("항공우주공학전공" , "공과대학");
        this.put("나노신소재공학과" , "공과대학");
        this.put("양자원자력공학과" , "공과대학");
        this.put("우주항공시스템공학부" , "공과대학");
        this.put("지구자원시스템공학과" , "공과대학");
        this.put("항공시스템공학과" , "공과대학");
        this.put("환경에너지공간융합학과" , "공과대학");
        this.put("기계항공우주공학부" , "공과대학");
        this.put("에너지자원공학과" , "공과대학");
        this.put("건축공학부" , "공과대학");
        this.put("원자력공학과" , "공과대학");


        this.put("경영학부" , "경영경제대학");
        this.put("경제학과" , "경영경제대학");
        this.put("경영학전공" , "경영경제대학");
        this.put("경제통상학과" , "경영경제대학");

        this.put("교육학과" , "인문과학대학");
        this.put("국어국문학과" , "인문과학대학");
        this.put("국제학부" , "인문과학대학");
        this.put("역사학과" , "인문과학대학");
        this.put("국제학부 영어영문학전공" , "인문과학대학");
        this.put("국제학부 일어일문학전공" , "인문과학대학");
        this.put("국제학부 중국통상학전공" , "인문과학대학");
        this.put("영어영문학전공" , "인문과학대학");
        this.put("일어일문학전공" , "인문과학대학");
        this.put("중국통상학전공" , "인문과학대학");


        this.put("법학부" , "단과대학없음");
        this.put("법학부 법학전공" , "단과대학없음");
        this.put("법학전공" , "단과대학없음");


        this.put("생명시스템학부" , "생명과학대학");
        this.put("생명시스템학부 바이오산업자원공학전공" , "생명과학대학");
        this.put("생명시스템학부 바이오융합공학전공" , "생명과학대학");
        this.put("생명시스템학부 식품생명공학전공" , "생명과학대학");
        this.put("바이오산업자원공학전공" , "생명과학대학");
        this.put("바이오융합공학전공" , "생명과학대학");
        this.put("식품생명공학전공" , "생명과학대학");
        this.put("스마트생명산업융합학과" , "생명과학대학");


        this.put("물리천문학과" , "자연과학대학");
        this.put("수학통계학과" , "자연과학대학");
        this.put("수학통계학부 수학전공" , "자연과학대학");
        this.put("수학전공" , "자연과학대학");
        this.put("수학통계학부 응용통계학전공" , "자연과학대학");
        this.put("응용통계학전공" , "자연과학대학");
        this.put("화학과" , "자연과학대학");


        this.put("반도체시스템공학과" , "전자정보공학대학");
        this.put("전자정보통신공학과" , "전자정보공학대학");
        this.put("광전자공학과" , "전자정보공학대학");


        this.put("행정학과" , "사회과학대학");
        this.put("미디어커뮤니케이션학과" , "사회과학대학");


        this.put("호텔관광외식경영학부" , "호텔관광대학");
        this.put("호텔관광외식경영학부 외식경영학전공" , "호텔관광대학");
        this.put("호텔관광외식경영학부 호텔관광경영학전공" , "호텔관광대학");
        this.put("외식경영학전공" , "호텔관광대학");
        this.put("외식경영전공" , "호텔관광대학");
        this.put("호텔관광경영학전공" , "호텔관광대학");
        this.put("호텔외식관광프랜차이즈경영학과" , "호텔관광대학");
        this.put("호텔외식비즈니스학과" , "호텔관광대학");
        this.put("글로벌조리학과" , "호텔관광대학");


        this.put("영상디자인 융합전공" , "연계전공");
        this.put("글로벌미디어소프트웨어 융합전공" , "연계전공");
        this.put("금융보험애널리틱스 융합전공" , "연계전공");
        this.put("뉴미디어퍼포먼스 융합전공" , "연계전공");
        this.put("디지털역사문화자원큐레이션융합전공" , "연계전공");
        this.put("럭셔리 브랜드 디자인 융합전공" , "연계전공");
        this.put("엔터테인먼트 소프트웨어 융합전공" , "연계전공");
        this.put("문화산업경영 융합전공" , "연계전공");
        this.put("융합전공" , "연계전공");
        this.put("비즈니스 애널리틱스 융합전공" , "연계전공");
        this.put("예술융합콘텐츠 융합전공" , "연계전공");
        this.put("융합창업전공" , "연계전공");
        this.put("과학기술커뮤니케이션 융합전공" , "연계전공");


        this.put("영화예술학과" , "예체능대학");
        this.put("음악과" , "예체능대학");
        this.put("체육학과" , "예체능대학");
        this.put("패션디자인학과" , "예체능대학");
        this.put("바이올린" , "예체능대학");
        this.put("성악" , "예체능대학");
        this.put("비올라" , "예체능대학");
        this.put("서양화" , "예체능대학");
        this.put("연출제작" , "예체능대학");
        this.put("시각디자인" , "예체능대학");
        this.put("연기예술" , "예체능대학");
        this.put("피아노" , "예체능대학");
        this.put("한국무용" , "예체능대학");
        this.put("한국화" , "예체능대학");
        this.put("발레" , "예체능대학");
        this.put("회화과" , "예체능대학");
        this.put("무용과" , "예체능대학");


        this.put("데이터사이언스학과" , "소프트웨어융합대학");
        this.put("소프트웨어학과" , "소프트웨어융합대학");
        this.put("지능기전공학부" , "소프트웨어융합대학");
        this.put("디지털콘텐츠학과" , "소프트웨어융합대학");
        this.put("인공지능학과" , "소프트웨어융합대학");
        this.put("지능기전공학과" , "소프트웨어융합대학");
        this.put("지능기전공학부 무인이동체공학전공" , "소프트웨어융합대학");
        this.put("지능기전공학부 스마트기기공학전공" , "소프트웨어융합대학");
        this.put("무인이동체공학전공" , "소프트웨어융합대학");
        this.put("스마트기기공학전공" , "소프트웨어융합대학");
        this.put("창의소프트학부" , "소프트웨어융합대학");
        this.put("창의소프트학부 디자인이노베이션전공" , "소프트웨어융합대학");
        this.put("창의소프트학부 만화애니메이션텍전공" , "소프트웨어융합대학");
        this.put("디자인이노베이션전공" , "소프트웨어융합대학");
        this.put("만화애니메이션텍전공" , "소프트웨어융합대학");
        this.put("컴퓨터공학과" , "소프트웨어융합대학");
        this.put("정보보호학과" , "소프트웨어융합대학");

    }

    public String getCollege(String major){
        return super.get(major);
    }
}